devdnl/dnx-rtos/src/system/drivers/sdspi/stm32f1/sdspi.c
        return 0;
}

//==============================================================================
/**SDSPI_SPI
 * @brief Direct IO control
 *
 * @param[in]     *drvhdl       driver's memory handle
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_ioctl(void *drvhdl, int iorq, va_list args)
{
        struct sdspi_data *hdl = drvhdl;
        stdret_t status = STD_RET_OK;

        if (!hdl) {
                return STD_RET_ERROR;
        }
#include "core/io.h"
        if (lock_recursive_mutex(hdl->port_lock_mtx, MTX_BLOCK_TIME) == MUTEX_LOCKED) {
                switch (iorq) {
                case SDSPI_IORQ_INITIALIZE_CARD:
                        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
                        for (int n = 0; n < 10; n++) {
                                spi_rw(0xFF);
                        }

                        int  timeout = 2 * SDSPI_WAIT_TIMEOUT;
                        u8_t cmd;
                        u8_t OCR[4];

                        hdl->card_type = 0;
                        hdl->card_initialized = false;

                        if (send_cmd(hdl, CMD0, 0) == 0x01) {
                                if (send_cmd(hdl, CMD8, 0x1AA) == 0x01) { /* check SDHC card */
                                        for (int n = 0; n < 4; n++) {
                                                OCR[n] = spi_rw(0xFF);
                                        }

                                        if (OCR[2] == 0x01 && OCR[3] == 0xAA) {
                                                while (--timeout && send_cmd(hdl, ACMD41, 1UL << 30)) {
                                                        sleep_ms(1);
                                                }

                                                if (timeout && send_cmd(hdl, CMD58, 0) == 0) {
                                                        for (int n = 0; n < 4; n++) {
                                                                OCR[n] = spi_rw(0xFF);
                                                        }

                                                        hdl->card_type = (OCR[0] & 0x40) ? CT_SD2 | CT_BLOCK : CT_SD2;
                                                }
                                        }
                                } else { /* SDSC or MMC */
                                        if (send_cmd(hdl, ACMD41, 0) <= 0x01)   {
                                                hdl->card_type = CT_SD1;
                                                cmd = ACMD41;   /* SDSC */
                                        } else {
                                                hdl->card_type = CT_MMC;
                                                cmd = CMD1;     /* MMC */
                                        }

                                        /* Wait for leaving idle state */
                                        while (timeout && send_cmd(hdl, cmd, 0)) {
                                                timeout--;
                                                sleep_ms(1);
                                        }

                                        /* set R/W block length to 512 */
                                        if (!timeout || send_cmd(hdl, CMD16, 512) != 0) {
                                                hdl->card_type = 0;
                                        }
                                }

                                if (timeout) {
                                        hdl->card_initialized = true;
                                        printk("Card initialized. Card type: 0x%x\n", hdl->card_type);
                                }
                        }

                        ioctl(hdl->gpio_file, GPIO_IORQ_SD_DESELECT);
                        spi_rw(0xFF);

                        if (hdl->card_initialized == false) {
                                printk("Card not initialized...\n");
                        }

                        break;

                default:
                        status = STD_RET_ERROR;
                        break;
                }
        } else {
                return STD_RET_ERROR;
        }

        return status;
}

//==============================================================================
/**
 * @brief Function flush device
 *
 * @param[in] *drvhdl           driver's memory handle
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
stdret_t SDSPI_flush(void *drvhdl)
{
        (void) drvhdl;

        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function open new partiotion file
 *
 * @param[in] *drvhdl   handler to partiotion description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_open(void *drvhdl)
{
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function close partition file
 *
 * @param[in] *drvhdl   handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_close(void *drvhdl)
{
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function write data to partition file
 *
 * @param[in] *drvhdl           handler to partition description
 * @param[in] *src              source
 * @param[in] size              size
 * @param[in] seek              seek
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_write(void *drvhdl, const void *src, size_t size, size_t nitems, size_t seek)
{
        return 0;
}

//==============================================================================
/**
 * @brief Function read data from partition file
 *
 * @param[in]  *drvhdl          handler to partition description
 * @param[out] *dst             destination
 * @param[in]  size             size
 * @param[in]  seek             seek
 *
 * @retval number of written nitems
 */
//==============================================================================
static size_t partition_read(void *drvhdl, void *dst, size_t size, size_t nitems, size_t seek)
{
        return 0;
}

//==============================================================================
/**
 * @brief Function control partition
 *
 * @param[in]    *drvhdl        handler to partition description
 * @param[in]     iorq          IO request
 * @param[in,out] args          additional arguments
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_ioctl(void *drvhdl, int iorq, va_list args)
{
        return STD_RET_ERROR;
}

//==============================================================================
/**
 * @brief Function flush partition
 *
 * @param[in] *drvhdl           handler to partition description
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t partition_flush(void *drvhdl)
{
        return STD_RET_OK;
}

//==============================================================================
/**
 * @brief Function turn on SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_on_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
#if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
#endif
#if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
#endif
#if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
#endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function turn off SPI clock
 *
 * @retval STD_RET_OK
 * @retval STD_RET_ERROR
 */
//==============================================================================
static stdret_t turn_off_SPI_clock(void)
{
        switch ((u32_t)SDSPI_PORT) {
#if defined(RCC_APB2ENR_SPI1EN)
        case SPI1_BASE:
                RCC->APB2RSTR |=  RCC_APB2RSTR_SPI1RST;
                RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
                RCC->APB2ENR  &= ~RCC_APB2ENR_SPI1EN;
                return STD_RET_OK;
#endif
#if defined(RCC_APB1ENR_SPI2EN)
        case SPI2_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI2RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI2RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI2EN;
                return STD_RET_OK;
#endif
#if defined(RCC_APB1ENR_SPI3EN)
        case SPI3_BASE:
                RCC->APB1RSTR |=  RCC_APB1RSTR_SPI3RST;
                RCC->APB1RSTR &= ~RCC_APB1RSTR_SPI3RST;
                RCC->APB1ENR  &= ~RCC_APB1ENR_SPI3EN;
                return STD_RET_OK;
#endif
        default:
                return STD_RET_ERROR;
        }
}

//==============================================================================
/**
 * @brief Function transmit command to card
 *
 * @param[in] *sdspi    SD SPI interface data
 * @param[in] cmd       card command
 * @param[in] arg       command's argument
 */
//==============================================================================
static u8_t send_cmd(struct sdspi_data *sdspi, u8_t cmd, u32_t arg)
{
        u8_t response;

        /* ACMD<n> is the command sequence of CMD55-CMD<n> */
        if (cmd & 0x80) {
                cmd &= 0x7F;
                response = send_cmd(sdspi, CMD55, 0);
                if (response > 1)
                        return response;
        }

        /* select the card and wait for ready */
        ioctl(sdspi->gpio_file, GPIO_IORQ_SD_DESELECT);
        ioctl(sdspi->gpio_file, GPIO_IORQ_SD_SELECT);

